HELP_START = """
    <b>Привет!</b> Я бот для знакомств. Вот список доступных команд:
    
    /help - прочитать инструкцию.
    /my - посмотреть мою анкету.
    /search - найти подходящую анкету.
    /start - создать или перезаписать анкету.
    
    <b>Команда /my:</b>
    Эта команда позволяет вам просмотреть вашу анкету. Вы можете увидеть информацию, которую вы ранее предоставили и внести изменения при необходимости.
    
    <b>Команда /search:</b>
    Используйте эту команду, чтобы найти подходящую анкету. Выведите критерии поиска и бот предоставит вам список анкет, которые соответствуют вашим требованиям.
    
    <b>Команда /start:</b>
    Вы можете использовать эту команду для создания новой анкеты или перезаписи текущей анкеты. Следуйте инструкциям и предоставьте необходимую информацию.
    
    Если у вас возникли дополнительные вопросы или проблемы, вы всегда можете обратиться в службу поддержки, отправив сообщение администратору бота.
    """